# Learning Pandas Package
## Pandas is used fo all things datasets

In [7]:
import pandas as pd

**create a panda series using list (column of data)**

In [17]:
eye_color = pd.Series(["red","brown","blue","green","purple"]) #this is a Series object
ages = pd.Series([45, 26, 14,45,12]) #this is another series object

print(f"Eye Color Series: \n{eye_color}") #show series
print()
print(f"Ages Series: \n{ages}") #show series

Eye Color Series:
0       red
1     brown
2      blue
3     green
4    purple
dtype: object

Ages Series:
0    45
1    26
2    14
3    45
4    12
dtype: int64

**Create a Data Frame**

In [19]:
eye_data = pd.DataFrame({
    "eye_color": eye_color, 
    "ages": ages
})

eye_data #in Jupyter, you can also print an object by just typing the name

  eye_color  ages
0       red    45
1     brown    26
2      blue    14
3     green    45
4    purple    12

**Creating DataFrame by importing external dataset file (e.g. .CSV)**

In [21]:
car_sales = pd.read_csv("assets/data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Exporting datasets to CSV file from DataFrame**

In [27]:
car_sales.to_csv("exported_car_sales_dataset.csv", index = False) #you have to tell Panda to not add an index column before exporting, else it will add it

**Importing CSV Datasets From Another Server**

Example: import from GitHub (note when importing data from GitHub, copy the "Raw" URL not the normal url by clicking on the "raw" button in the section tabs

In [28]:
car_sales_frm_url = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/refs/heads/master/data/car-sales.csv")
car_sales_frm_url

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Taking a glance at a DataFrame**

In [29]:
car_sales.dtypes #show the data types of the columns in the Data Frame

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [31]:
car_sales.info() #show the general metadata of the features (columns) in the Data Frame, including the number of non-null cells

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [34]:
car_sales.describe() #give a quick analysis or description of the data frame

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [58]:
car_sales["Make"].index #provide a summary of the index range of a series

RangeIndex(start=0, stop=10, step=1)

**Getting a column**

In [46]:
car_sales["Make"] #getting a column (Simila to Dicts; another way is the .get function)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

**You can perform analysis with series and dataframes**

In [49]:
car_sales["Odometer (KM)"].mean()

np.float64(78601.4)

In [50]:
car_sales["Odometer (KM)"].sum()

np.int64(786014)

In [54]:
car_sales["Odometer (KM)"][0] #give me an item from the dataframe. In this case the first element in the Odometer series

np.int64(150043)